uhnp/src/Catalogs/ВидыОтчетов/ВидыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОтчетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидАналитики1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики6</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАналитик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктуальныйШаблон</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрБухгалтерии</name>
    <type>
      <types>CatalogRef.РегистрыБухгалтерииБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьЗабалансовыеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФормироватьАналитическиеРаскрытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыводитьГруппирующиеСчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СокращеннаяОСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучатьБухгалтерскиеИтогиПоГруппирующимСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРакурсы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникБД</name>
    <type>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПоСтруктуреСправочника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожетИспользоватьсяДляУстановкиЛимитов</name>
    <comment>ОПК</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистраИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектДляСогласованияЗначений</name>
    <type>
      <types>EnumRef.ОбъектыСогласованияЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоВыбраннымСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаФормированияФормул</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулыДляНачальныхСальдо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВидыИтоговПоСчетам</name>
    <attributes>
      <name>ВидИтогаПоСчету</name>
      <type>
        <types>EnumRef.ВидыБухгалтерскихИтогов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыУстановкиЛимитов</name>
    <comment>ОПК</comment>
    <attributes>
      <name>КолонкаОтчета</name>
      <comment>ОПК</comment>
      <type>
        <types>CatalogRef.КолонкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предназначение</name>
      <comment>ОПК</comment>
      <type>
        <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеСчета</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетИспользуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ПредназначенияЭлементовСтруктурыОтчета/ПредназначенияЭлементовСтруктурыОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПредназначенияЭлементовСтруктурыОтчета</name>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ОборотноСальдоваяВедомость</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>БюджетДоходовИРасходов</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ТрансформационныеКорректировки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ВидыОтчетов/Forms/ФормаГруппы/Module.bsl
&НаСервере
Процедура ОбновитьРегистрБухгалтерии()
	
	МассивРегистров=УправлениеОтчетамиУХ.ПолучитьМассивРегистровБухгалтерии(Объект.ПланСчетов);	
	Элементы.РегистрБухгалтерии.СписокВыбора.Очистить();
	
	Для Каждого Регистр ИЗ МассивРегистров Цикл
		
		Элементы.РегистрБухгалтерии.СписокВыбора.Добавить(Регистр);
		
	КонецЦикла;
	
	Если Элементы.РегистрБухгалтерии.СписокВыбора.Количество()>0 Тогда
		
		Если НЕ Объект.РегистрБухгалтерии=Элементы.РегистрБухгалтерии.СписокВыбора[0].Значение Тогда	
			
			Объект.РегистрБухгалтерии=Элементы.РегистрБухгалтерии.СписокВыбора[0].Значение;
			
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры // ОбновитьРегистрБухгалтерии()

&НаСервереБезКонтекста
Функция СформироватьКодПоНаименованию(Наименование)
	
	Возврат ОбщегоНазначенияУХ.СформироватьКодНаОснованииНаименования(Наименование,,"ВидыОтчетов");
	
КонецФункции // СформироватьКодПоНаименованию() 

&НаКлиенте
Процедура ПланСчетовПриИзменении(Элемент)
	
	ОбновитьРегистрБухгалтерии();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ГруппаПланСчетов.Видимость		= (Не Объект.Предназначение=Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ПроизвольныеДанные);		
	Элементы.РегистрБухгалтерии.Видимость	= (НЕ Элементы.РегистрБухгалтерии.СписокВыбора.Количество()=1);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПредназначения()
	
	Если НЕ Объект.Предназначение=Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ПроизвольныеДанные Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ПланСчетов) Тогда
			
			ПланыСчетов=Справочники.ПланыСчетовБД.Выбрать(,Справочники.ТипыБазДанных.ТекущаяИБ);
			
			Если ПланыСчетов.Следующий() Тогда
				
				Объект.ПланСчетов=ПланыСчетов.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Справочники.РегистрыБухгалтерииБД.ПроверитьНаличиеОписанийРегистров(,Объект.ПланСчетов,Объект.РегистрБухгалтерии);
		ОбновитьРегистрБухгалтерии();
		
	КонецЕсли;
	
	УстановитьВидимость();
		
КонецПроцедуры // ПриИзмененииПредназначения() 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() И (Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования)) Тогда
		
		Справочники.ВидыОтчетов.ЗаполнитьРеквизитыПоРодителю(Объект);
			
	КонецЕсли;
	
	Если Не Объект.Предназначение=Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ПроизвольныеДанные Тогда
		ОбновитьРегистрБухгалтерии();
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредназначениеПриИзменении(Элемент)
	
	ПриИзмененииПредназначения();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	// Сформируем код.
	Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда
		Объект.Код = СформироватьКодПоНаименованию(Объект.Наименование);
	Иначе
		// Код уже заполнен. Не изменяем существующее значение.
	КонецЕсли;
КонецПроцедуры
